# PointCloudOverrideSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudOverrideSettings Methods
PointCloudOverrideSettings Class See Also
---
The PointCloudOverrideSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Assign | Assigns values of the source settings to this object. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetModeOverride | Lookup color settings for the given color mode. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Checks if the contents of two settings are equal. |
| SetModeOverride | Sets color settings for the given color mode. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace